---
kind: method
id: M:Autodesk.Revit.DB.ModelPath.GetProjectGUID
source: html/81e80465-626a-5659-5383-25fef813c270.htm
---
# Autodesk.Revit.DB.ModelPath.GetProjectGUID Method

A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.

## Syntax (C#)
```csharp
public Guid GetProjectGUID()
```